package kr.o3selab.homecoco.Models;

public class TermsContent {

    public static String terms = "서비스 이용약관\n" +
            "\n" +
            "[1장 총칙]\n" +
            "\n" +
            "제 1 조 (목적)\n" +
            "  본 약관은 이용고객이 주식회사 홈코코(이하 “회사”라 합니다)이 제공하는 “서비스”를 이용함에 있어 회사와 이용 고객 간의 권리와 의무 및 책임사항을 규정함을 목적으로 합니다.\n" +
            "\n" +
            "제 2 조 (정의)\n" +
            "  본 약관에서 사용하는 주요 용어는 다음과 같습니다.\n" +
            "  1. “홈코코”이라 함은 회사가 생활형(홈서비스등) 서비스를 이용고객에게 제공하기 위하여 컴퓨터 등 정보통신설비를 이용하여 재화, 용역을 거래할 수 있도록 설정한 가상의 영업장 또는 회사가 운영하는 웹(앱)사이트를 말하며, 아울러 ”홈코코”를 운영하는 사업자의 의미로도 사용합니다.\n" +
            "  2. “서비스”라 함은, 구현되는 단말기(PC, 태블릿, 휴대용 단말기 등의 각 종 유무선 장치)와 상관없이 브랜드명 ‘홈코코”을 사용하여 “회사”가 제공하는 제반 서비스를 말합니다.\n" +
            "  3. “이용고객” 이라 함은, 회사의 “서비스”에 접속하여 본 약관에 따라 회사가 제공하는 서비스를 받는 회원과 비회원을 말합니다.\n" +
            "  4. “게시물” 이라 함은, “이용고객”이 “서비스”를 이용함에 있어 “서비스상”에 게시한 부호ㆍ문자ㆍ음성ㆍ음향ㆍ화상ㆍ동영상 등의 정보 형태의 글, 사진, 동영상 및 각종 파일과 링크 등을 의미합니다.\n" +
            "  5. “주문거래”라 함은 이용고객이 서비스를 이용함에 있어 결제서비스를 이용하여 매매거래가 이루어지는 일체를 말합니다.\n" +
            "  6. “포인트”라 함은 회원이 서비스 이용을 함으로써 회사가 회원에 제공하는 사이버 화폐를 말합니다.\n" +
            "\n" +
            "제 3 조 (약관의 게시, 효력 및 개정)\n" +
            "  1. 회사는 본 약관의 내용을 이용고객이 쉽게 알 수 있도록 서비스 초기 화면에 게시합니다.\n" +
            "  2. 회사는 콘텐츠산업 진흥법, 전자상거래 등에서의 소비자보호에 관한 법률, 약관의 규제에 관한 법률, 소비자기본법 등 관련법을 위배하지 않는 범위에서 본 약관을 개정할 수 있습니다.\n" +
            "  3. 회사가 약관을 개정할 경우에는 기존약관과 개정약관 및 개정약관의 적용일자와 개정사유를 명시하여 현행약관과 함께 그 적용일자 삼십(30)일 전부터 일정기간 서비스 내 공지하고, 로그인시 동의창 등의 전자적 수단을 통해 고지합니다.\n" +
            "  4. 회사가 전항에 따라 이용고객에게 통지하면서 공지 또는 공지고지일로부터 개정약관 시행일 7일 후까지 거부의사를 표시하지 않으면 승인한 것으로 본다는 뜻을 명확하게 고지하였음에도, 이용고객이 명시적으로 거부의 의사 표시를 하지 않은 경우에는 변경된 약관을 승인한 것으로 봅니다.\n" +
            "  5. 이용고객이 개정약관에 동의하지 않을 경우 이용고객은 제26조 제1항의 규정에 따라 이용계약을 해지할 수 있습니다.\n" +
            "  6. 본 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 정부가 제정한 전자거래소비자보호지침 및 관계법령 또는 상관례에 따릅니다.\n" +
            "\n" +
            "[2장 서비스의 이용]\n" +
            "\n" +
            "제 4 조 (서비스 이용)\n" +
            "  1. 서비스 이용은 회사의 서비스 사용 승낙 직후부터 가능합니다.\n" +
            "  2. 서비스 이용시간은 회사의 업무상 또는 기술상 불가능한 경우를 제외하고는 연중무휴 1일 24시간(00:00-24:00)으로 함을 원칙으로 합니다. 다만, 서비스 설비의 정기점검 등의 사유로 회사가 서비스를 특정범위로 분할하여 별도로 날짜와 시간을 정할 수 있습니다.\n" +
            "\n" +
            "제 5 조 (서비스 내용 변경통지 등)\n" +
            "  회사가 서비스 내용을 변경하거나 종료하는 경우 회사는 서비스의 공지사항, SMS 등의 전자적 방식을 통하여 서비스 내용의 변경 사항 또는 종료를 통지할 수 있습니다.\n" +
            "\n" +
            "제 6 조 (서비스 이용의 제한 및 중지)\n" +
            "  1. 회사는 다음 사유가 발생한 경우에는 이용고객의 서비스 이용을 제한하거나 중지시킬 수 있습니다.\n" +
            "    가. 이용고객이 회사 서비스의 운영을 고의 또는 중과실로 방해하는 경우\n" +
            "    나. 이용고객이 제8조의 의무를 위반한 경우\n" +
            "    다. 서비스용 설비 점검, 보수 또는 공사로 인하여 부득이한 경우\n" +
            "    라. 전기통신사업법에 규정된 기간통신사업자가 전기통신 서비스를 중지했을 경우\n" +
            "    마. 국가비상사태, 서비스 설비의 장애 또는 서비스 이용의 폭주 등으로 서비스 이용에 지장이 있는 때\n" +
            "    바. 기타 중대한 사유로 인하여 회사가 서비스 제공을 지속하는 것이 부적당하다고 인정하는 경우\n" +
            "  2. 회사는 “주민등록법\"을 위반한 명의도용 및 결제도용, 전화번호 도용, \"저작권법\" 및 \"컴퓨터프로그램보호법\"을 위반한 불법프로그램의 제공 및 운영방해, \"정보통신망법\"을 위반한 불법통신 및 해킹, 악성프로그램의 배포, 접속권한 초과행위 등과 같이 관련법을 위반한 경우에는 즉시 영구이용정지를 할 수 있습니다. 본 항에 따른 영구이용정지 시 서비스 이용을 통해 획득한 혜택 등도 모두 소멸되며, 회사는 이에 대해 별도로 보상하지 않습니다.\n" +
            "  3. 회사는 본 조에 따라 서비스의 이용을 제한하거나 중지한 때에는 그 사유 및 제한 기간 등을 제5조 [서비스 내용 변경통지 등]에 따라 이용고객에게 통지합니다.\n" +
            "  4. 이용고객은 본 조에 따른 이용제한 등에 대해 회사가 정한 절차에 따라 이의신청을 할 수 있습니다. 이 때 이의가 정당하다고 회사가 인정하는 경우 회사는 즉시 서비스의 이용을 재개합니다.\n" +
            "\n" +
            "제 7 조 (권리의 귀속 및 저작물의 이용)\n" +
            "  1. 회사가 이용고객에게 제공하는 각종 서비스에 대한 저작권을 포함한 일체의 권리는 회사에 귀속되며 이용고객이 서비스를 이용하는 과정에서 작성한 게시물에 대한 저작권을 포함한 일체에 관한 권리는 별도의 의사표시가 없는 한 해당 이용고객에게 귀속됩니다.\n" +
            "  2. 회사 는 서비스의 운영, 전시, 전송, 배포, 홍보 의 목적으로 이용고객의 별도의 허락 없이 무상으로 저작권법에 규정하는 공정한 관행에 합치되게 합리적인 범위 내에서 다음과 같이 이용고객이 등록한 게시물을 사용할 수 있습니다.\n" +
            "\n" +
            "다 음 \n" +
            "  서비스 내에서 이용고객의 게시물의 복제, 수정, 개조, 전시, 전송, 배포 및 저작물성을 해치지 않는 범위 내에서의 편집 저작물 작성 미디어 , 통신사 등 서비스 제휴 파트너에게 회원의 게시물 내용을 제공, 전시 혹은 홍보하게 하는 것.\n" +
            "\n" +
            "제 8 조 (회원 및 비회원 이용고객의 의무)\n" +
            "  1. 회원 및 비회원 이용고객은 다음 행위를 하여서는 안 됩니다.\n" +
            "    가. 회원정보에 허위 내용을 등록하는 행위\n" +
            "    나. 회사의 서비스에 게시된 정보를 변경하거나 서비스를 이용하여 얻은 정보를 회사의 사전 승낙 없이 영리 또는 비영리의 목적으로 복제, 출판, 방송 등에 사용하거나 제3자에게 제공하는 행위\n" +
            "    다. 회사 기타 제3자의 명예를 훼손하거나 지적재산권을 침해하는 등 회사나 제3자의 권리를 침해하는 행위\n" +
            "    라. 다른 회원의 회원 정보 또는 이용고객의 정보를 도용하여 부당하게 서비스를 이용한 경우\n" +
            "    마. 정크메일(junk mail), 스팸메일(spam mail), 행운의 편지(chain letters), 피라미드 조직에 가입할 것을 권유하는 메일, 외설 또는 폭력적인 메시지 ·화상·음성 등이 담긴 메일을 보내거나 기타 공서양속에 반하는 정보를 공개 또는 게시하는 행위\n" +
            "    바. 정보통신망이용촉진및정보보호등에관한법률 등 관련 법령에 의하여 그 전송 또는 게시가 금지되는 정보(컴퓨터 프로그램 등)를 전송하거나 게시하는 행위\n" +
            "    사. 공공질서 또는 미풍양속에 위배되는 내용의 정보, 문장, 도형, 음성 등을 유포하는 행위\n" +
            "    아. 회사의 직원이나 서비스의 관리자를 가장하거나 사칭하여 또는 타인의 명의를 모용하여 글을 게시하거나 메시지를 발송하는 행위\n" +
            "    자. 컴퓨터 소프트웨어, 하드웨어, 전기통신 장비의 정상적인 가동을 방해, 파괴할 목적으로 고안된 소프트웨어 바이러스, 기타 다른 컴퓨터 코드, 파일, 프로그램을 포함하고 있는 자료를 게시하거나 전자우편, SMS로 발송하는 행위\n" +
            "    차. 스토킹(stalking) 등 다른 이용고객의 서비스 이용을 방해하는 행위\n" +
            "    카. 다른 이용고객의 개인정보를 그 동의 없이 수집, 저장, 공개하는 행위\n" +
            "    타. 불특정 다수의 이용고객을 대상으로 하여 광고 또는 선전을 게시하거나 스팸메일을 전송하는 등의 방법으로 회사에서 제공하는 서비스를 이용하여 영리목적의 활동을 하는 행위\n" +
            "    파. 현행 법령, 회사가 제공하는 서비스에 정한 약관 기타 서비스 이용에 관한 규정을 위반하는 행위\n" +
            "  2. 회사는 회원 또는 비회원 이용고객이 제1항의 행위를 하는 경우 서비스의 이용을 제한하거나 일방적으로 본 계약을 해지할 수 있습니다.\n" +
            "\n" +
            "제 9 조 (회사의 의무)\n" +
            "  1. 회사는 회사의 서비스 제공 및 보안과 관련된 설비를 지속적이고 안정적인 서비스 제공에 적합하도록 유지, 점검 또는 복구 등의 조치를 성실히 이행하여야 합니다.\n" +
            "  2. 회사는 이용고객이 원하지 아니하는 영리 목적의 광고성 전자우편이나 SMS를 발송하지 않습니다.\n" +
            "  3. 회사는 서비스의 제공과 관련하여 알게 된 이용고객의 개인정보를 본인의 승낙 없이 제3자에게 누설, 배포하지 않고, 이를 보호하기 위하여 노력합니다. 회원의 개인정보보호에 관한 기타의 사항은 정보통신망 이용촉진 및 정보보호등에 관한 법률 등 관계법령 및 회사가 별도로 정한 “개인정보취급방침”에 따릅니다.\n" +
            "\n" +
            "제 10 조 (홈코코와 홈코코 웹사이트 간의 관계)\n" +
            "  1. 홈코코와 연결된 웹사이트란 하이퍼 링크(예: 하이퍼 링크의 대상에는 문자, 그림 및 동화상 등이 포함됨)방식 등으로 연결된 경우를 말합니다.\n" +
            "  2. 회사는 연결된 웹사이트가 독자적으로 제공하는 재화, 용역으로 이용고객과 해당 웹사이트가 행하는 거래에 대해서 보증책임을 포함하여 일체의 책임을 지지 않습니다.\n" +
            "\n" +
            "제 11 조 (양도금지)\n" +
            "  이용고객의 서비스 받을 권리는 이를 양도 내지 증여하거나 질권의 목적으로 제공 할 수 없습니다.\n" +
            "\n" +
            "제 12 조 (포인트서비스)\n" +
            "  1. “포인트”는 회사의 정책에 따라 회원에게 부여가 되며, 사용기간은 적립일로부터 2년이며, 적립기준, 사용조건 및 제한에 관한 사항은 서비스 화면에 별도로 게시하거나 통지합니다. “포인트”의 사용조건에 관한 사항은 회사의 정책에 따라 달라질 수 있습니다.\n" +
            "  2. 회원의 탈퇴 및 자격상실이 될 경우 “포인트”는 자동 소멸됩니다.\n" +
            "\n" +
            "제 13 조 (주문거래 기록의 보관)\n" +
            "  “주문거래”의 거래기록은 전자상거래등에서의 소비자보호에 관한 법률에 규정에 의해 일정기간 동안 보존 할 수 있습니다.\n" +
            "\n" +
            "제 14 조 (주문거래 시 가능한 결제 수단)\n" +
            "  홈코코에서 구매한 재화 또는 용역에 대한 대금지급방법은 이용고객과 업체에서 각자 정하는 방식으로 상호간에 결정할 수 있습니다.\n" +
            "\n" +
            "제 15 조 (법정대리인의 권리)\n" +
            "  1. 회사는 14세 미만의 이용고객에 대해서는 개인위치정보를 이용한 위치기반서비스 제공 및 개인위치정보의 제 3자 제공에 대한 동의를 당해 이용고객과 당해 이용고객의 법정대리인으로부터 동의를 받아야 합니다. 이 경우 법정대리인은 제7조에 의한 이용고객의 권리를 모두 가집니다.\n" +
            "  2. 회사는 14세 미만의 아동의 개인위치정보 또는 위치정보 이용제공사실 확인자료를 이용 약관에 명시 또는 고지한 범위를 넘어 이용하거나 제3자에게 제공하고자 하는 경우에는 14세미만의 아동과 그 법정대리인의 동의를 받아야 합니다. 단, 아래의 경우는 제외합니다.\n" +
            "    가. 위치정보 및 위치기반서비스 제공에 따른 요금정산을 위하여 위치정보 이용, 제공사실 확인자료가 필요한 경우\n" +
            "    나. 통계작성, 학술연구 또는 시장조사를 위하여 특정 개인을 알아볼 수 없는 형태로 가공하여 제공하는 경우\n" +
            "\n" +
            "제 16 조 (8세 이하의 아동 등의 보호의무자의 권리)\n" +
            "  1. 회사는 아래의 경우에 해당하는 자(이하 “8세 이하의 아동 등”이라 한다)의 보호의무자가 8세 이하의 아동 등의 생명 또는 신체보호를 위하여 개인위치정보의 이용 또는 제공에 동의하는 경우에는 본인의 동의가 있는 것으로 봅니다.\n" +
            "    가. 8세 이하의 아동\n" +
            "    나. 금치산자\n" +
            "    다. 장애인복지법 제2조 제2항 제2호의 규정에 의한 정신적 장애를 가진 자로서 장애인고용촉진 및 직업재활법 제2조 제2호의 규정에 의한 중증장애인에 해당하는 자(장애인 복지법 제29조의 규정에 의하여 장애인 등록을 한 자에 한한다.)\n" +
            "  2. 8세 이하의 아동 등의 생명 또는 신체의 보호를 위하여 개인위치정보의 이용 또는 제공에 동의를 하고자 하는 보호의무자는 서면동의서에 보호의무자임을 증명하는 서면을 첨부하여 회사에 제출하여야 합니다.\n" +
            "  3. 보호의무자는 8세 이하의 아동 등의 개인위치정보 이용 또는 제공에 동의하는 경우 개인위치정보주체 권리의 전부를 행사할 수 있습니다.\n" +
            "\n" +
            "제 17 조 (위치정보관리책임자의 지정)\n" +
            "  1. 회사는 위치정보를 적절히 관리, 보호하고 개인위치정보주체의 불만을 원활히 처리할 수 있도록 실질적인 책임을 질 수 있는 지위에 있는 자를 위치정보관리 책임자로 지정해 운영합니다.\n" +
            "  2. 위치정보관리책임자는 위치기반 서비스를 제공하는 부서의 부서장으로서 구체적인 사항은 본 약관의 부칙에 따릅니다.\n" +
            "\n" +
            "[3장 기타]\n" +
            "\n" +
            "제 18 조 (개인정보보호)\n" +
            "  1. 회사는 회원의 개인정보를 보호하기 위하여 정보통신망법 및 개인정보 보호법 등 관계 법령에서 정하는 바를 준수합니다.\n" +
            "  2. 회사는 회원의 개인정보를 보호하기 위해 \"개인정보취급방침\"을 수립하고 개인정보 보호 책임자를 지정하여 이를 게시하고 운영합니다.\n" +
            "  3. 회사의 공식 사이트 이외의 링크된 사이트에서는 회사의 개인정보취급방침이 적용되지 않습니다. 링크된 사이트 및 구매 상품이나 서비스를 제공하는 제3자의 개인정보 취급과 관련하여 해당 사이트 및 제3자의 개인정보취급방침을 확인할 책임이 회원에게 있으며, 회사는 이에 대하여 책임을 부담하지 않습니다.\n" +
            "  4. 회사는 이용계약을 위하여 이용고객이 제공한 정보를 회사 서비스 운영을 위한 목적 이외의 용도로 사용하거나 이용고객의 동의 없이 제3자에게 제공하지 않습니다. 단, 다음 각 호의 경우에는 예외로 합니다.\n" +
            "    가. 법령에 근거하여 회원정보의 이용과 제3자에 대한 정보제공을 허용하고 있는 경우\n" +
            "    나. 배송업무 등에 필요한 최소한의 회원정보를 알려 주는 경우\n" +
            "    다. 기타 회사의 약관 및 정책에 따라 이용고객의 동의를 구한 경우\n" +
            "\n" +
            "제 19 조 (이용계약의 해지)\n" +
            "  1. 회원은 언제든지 회사가 정하는 절차에 따라 이용계약 해지 신청을 할 수 있으며, 회사는 관련법 등이 정하는 바에 따라 이를 즉시 처리하여야 합니다.\n" +
            "  2. 회원이 계약을 해지할 경우, 관련법 및 회사가 별도로 정하는 “개인정보취급방침”에 따라 회사가 회원의 개인정보 등을 보유하는 경우를 제외하고는 해지 즉시 회원의 모든 개인정보 등은 삭제됩니다.\n" +
            "  3. 회원이 계약을 해지하는 경우, 회원이 작성한 게시물 중 프로필 등과 같이 본인 계정에 등록된 게시물 일체는 삭제됩니다. 다만, 다른 회원에 의해 담기, 스크랩 등이 되어 재게시되거나, 공용게시판에 등록된 게시물 등은 삭제되지 않으니 사전에 삭제 후 탈퇴하시기 바랍니다.\n" +
            "  4. “회원”이 제8조의 규정을 위반한 경우 회사는 사전통보 없이 일방적으로 본 계약을 해지할 수 있고, 이로 인하여 서비스 운영에 손해가 발생한 경우 이에 대한 민, 형사상 책임도 물을 수 있습니다.\n" +
            "\n" +
            "제 20 조 (면책조항)\n" +
            "  1. 회사는 다음 사유로 서비스를 제공할 수 없는 경우 이로 인하여 회원에게 발생한 손해에 대해서는 책임을 부담하지 않습니다.\n" +
            "    가. 천재지변 또는 이에 준하는 불가항력의 상태가 있는 경우\n" +
            "    나. 서비스 제공을 위하여 회사와 서비스 제휴계약을 체결한 제3자의 고의적인 서비스 방해가 있는 경우\n" +
            "    다. 회원의 귀책사유로 서비스 이용에 장애가 있는 경우\n" +
            "    라. 기타 회사의 고의 과실이 없는 사유로 인한 경우\n" +
            "  2. 회사는 이용고객이 서비스를 이용하여 얻은 정보, 자료, 사실의 신뢰도, 정확성 등에 대해서는 보증을 하지 않으며 이로 인해 발생한 이용고객의 손해에 대하여는 책임을 부담하지 않습니다.\n" +
            "  3. 회사를 통해 접수를 하지 않아 전산에서 조회가 되지 않는 건에 대해 당사는 책임을 지지 않습니다.\n" +
            "  4. 회사는 이용고객이 서비스를 이용하여 기대하는 수익을 얻지 못하거나 상실한 것에 대하여 책임을 지지 않으며, 이용고객 상호간 및 이용고객과 제3자 상호간에 서비스를 매개로 발생한 분쟁에 대해 개입할 의무가 없고, 이로 인한 손해를 배상할 책임도 부담하지 않습니다.\n" +
            "  5. 서비스계약은 이용고객과 업체 간의 계약이므로 서비스과정에서 발생한 하자의 경우 회사는 원칙적으로 배상의 책임이 없으며, 다만 회사는 이용고객과 업체 간의 적극적 중재역할을 담당합니다.\n" +
            "  6. 회사는 무료로 제공되는 서비스 이용과 관련하여 관련법에 특별한 규정이 없는 한 책임을 지지 않습니다.\n" +
            "\n" +
            "제 21 조 (분쟁의 해결)\n" +
            "  1. 회사는 이용고객이 제기하는 정당한 의견이나 불만을 반영하고 그 피해를 보상처리하기 위하여 피해보상처리기구를 설치·운영합니다.\n" +
            "  2. 회사는 이용고객으로부터 제출되는 불만사항 및 의견은 우선적으로 그 사항을 처리합니다. 다만, 신속한 처리가 곤란한 경우에는 이용고객에게 그 사유와 처리일정을 즉시 통보해 줍니다.\n" +
            "  3. 회사와 이용 고객간에 발생한 전자상거래 분쟁과 관련하여 이용고객의 피해구제신청이 있는 경우에는 공정거래위원회 또는 시·도지사가 의뢰하는 분쟁조정기관의 조정에 따를 수 있습니다.\n" +
            "\n" +
            "제 22 조 (재판권 및 준거법)\n" +
            "  본 약관은 대한민국법령에 의하여 규정되고 이행되며, 서비스 이용과 관련하여 회사와 이용고객간에 발생한 분쟁에 대해서는 민사소송법상의 주소지를 관할하는 법원을 합의관할로 합니다.\n" +
            "\n" +
            "부칙\n" +
            "  제1조. 본 약관은 2017년 4월 10일부터 적용됩니다.\n" +
            "  제2조. 회원정보관리책임자는 다음과 같습니다. \n" +
            "    1. 이름: 이상구\n" +
            "    2. 연락처: 1588-4602";

    public static String privacy = "" +
            "1. 개인정보 보호와 취급방침\n" +
            "  ㄱ. “홈코코 개인정보 취급방침”이란 이용자의 소중한 개인정보를 보호함으로써 이용자가 안심하고 서비스를 이용할 수 있도록 홈코코(이하 “홈코코”이라 함)을 운영함에 있어 준수해야 할 지침을 의미하며, 홈코코는 대한민국의 개인정보보호 규정 및 가이드라인을 준수하고 있습니다.\n" +
            "  ㄴ. 홈코코는 이용자의 ‘동의를 기반으로 개인정보를 수집·이용 및 제공’ 하고 있으며, ‘이용자의 권리(개인정보 자기결정권)를 적극적으로 보장’ 합니다.\n" +
            "  ㄷ. 본 개인정보취급방침은 홈코코가 운영하는 서비스에서 적용되는 것을 원칙으로 하며 본 개인정보취급방침은 대한민국 법령에 의하여 규정되고 해석됩니다.\n" +
            "\n" +
            "2. 개인정보 수집 항목 및 방법\n" +
            "  모든 이용자는 홈코코가 제공하는 서비스를 이용할 수 있고, 홈코코의 다양한 서비스를 제공받을 수 있습니다. 그리고 이때 홈코코는 다음의 원칙하에 이용자의 개인정보를 수집하고 있습니다.\n" +
            "  ㄱ. 홈코코는 서비스 제공에 필요한 최소한의 개인 정보를 수집하고 있습니다.\n" +
            "  [개인정보 수집 항목]\n" +
            "    예약자명, 휴대폰번호, 거주지역, 서비스 예약, 방문 일시\n" +
            "  [개인정보 수집방법]\n" +
            "    서비스 이용, 전화, 고객센터 등\n" +
            "  ㄴ. 홈코코는 민감 정보를 수집하지 않습니다.\n" +
            "  홈코코는 이용자의 소중한 인권을 침해할 우려가 있는 민감한 정보(인종, 사상 및 신조, 정치적 성향이나 범죄기록, 의료정보 등)는 어떠한 경우에도 수집하지 않으며, 만약 법령에서 정한 의무에 따라 불가피하게 수집하는 경우에는 반드시 이용자에게 사전 동의를 거치겠습니다.\n" +
            "  다만, 해당 정보는 이용자가 확인한 시점을 기준으로 한 정보이며, 이용자의 개인정보를 추가 수집하는 경우에는 반드시 사전에 이용자에게 해당 사실을 알리고 동의를 거치겠습니다.\n" +
            "\n" +
            "3. 개인정보 이용 목적\n" +
            "  홈코코는 이용자의 소중한 개인정보를 다음과 같은 목적으로만 이용하며, 목적이 변경될 경우에는 사전에 이용자의 동의를 구하도록 하겠습니다.\n" +
            "  ㄱ. 기기의 고유한 번호로 이용자를 식별하고, 불량 회원의 부정한 이용을 방지하기 위하여 사용합니다.\n" +
            "  ㄴ. 이용자에게 홈코코의 다양한 서비스를 제공하고 서비스 이용 과정에서 이용자의 문의 사항이나 불만을 처리하고 공지사항 등을 전달하기 위해 사용합니다.\n" +
            "  ㄷ. 이용자와 약속한 서비스를 제공하고 유료 서비스 구매 및 이용이 이루어지는 경우 이에 따른 요금 정산을 위해 사용됩니다.\n" +
            "  ㄹ. 신규 서비스가 개발되거나 이벤트 행사 시 참여 기회를 알리기 위한 정보 전달 및 마케팅, 광고 등에도 사용됩니다.\n" +
            "  ㅁ. 이용자의 이용 패턴과 접속 빈도 분석 및 서비스 이용에 대한 통계 및 이를 통한 맞춤형 서비스 제공 및 서비스 개선에도 사용됩니다.\n" +
            "\n" +
            "4. 개인정보 보유 및 기간\n" +
            "  홈코코는 이용자의 개인정보를 서비스 이용 시작일부터 서비스를 제공하는 기간 동안에만 제한적으로 이용하고 있습니다. 이용자가 개인정보 삭제를 요청하거나 제공한 개인정보의 수집 및 이용에 대한 동의를 철회하는 경우, 또는 수집 및 이용목적이 달성되거나 보유 및 이용기간이 종료한 경우 해당 이용자의 개인정보는 지체 없이 파기됩니다. 그리고 관계 법령의 규정에 따라 일정한 기간 동안 회원정보를 보관하며 자세한 내용은 아래와 같습니다.\n" +
            "\n" +
            "소비자의 불만 및 분쟁처리에 관한 기록\n" +
            "  보존근거 : 전자상거래 등에서의 소비자보호에 관한 법률\n" +
            "  보존기간 : 3년\n" +
            "대금결제 및 재화 등의 공급에 관한 기록\n" +
            "  보존 이유 : 전자상거래 등에서의 소비자보호에 관한 법률 제6조 및 시행령 제6조\n" +
            "  보존 기간 : 5년\n" +
            "접속에 관한 기록\n" +
            "  보존 이유 : 통신비밀보호법 제15조의2 및 시행령 제41조\n" +
            "  보존기간 : 3개월\n" +
            "부정거래기록\n" +
            "  보존 이유 : 부정거래의 배제 등 회사 방침에 의한 보존\n" +
            "  보존 기간 : 5년\n" +
            "\n" +
            "5. 개인정보 취급위탁\n" +
            "  회사는 개인정보를 위탁하지 않고 있습니다.\n" +
            "\n" +
            "6. 개인정보 제 3자 제공\n" +
            "  ㄱ. 홈코코는 원칙적으로 이용자의 동의 없이 개인정보를 제3자에게 제공하지 않으며, 개인정보를 제3자에게 제공해야 하는 경우 법령에 따른 동의를 받고 있습니다. 다만 다음의 경우는 예외로 하고 있습니다.\n" +
            "    가. 이용자가 사전에 공개하거나 또는 제3자 제공에 동의한 경우입니다.\n" +
            "    나. 법원 등 국가기관이 법령에 근거하여 이용자의 개인정보를 제공하도록 강제한 경우입니다.\n" +
            "  ㄴ. 홈코코는 서비스 제공을 위해서 아래와 같이 업무를 위탁 또는 제휴하는 경우, 관계 법령에 따라 위탁 및 제휴계약 시 제공하는 개인정보가 안전하게 관리될 수 있도록 필요한 사항을 규정하고 있습니다.\n" +
            "홈코코의 개인정보 공유 대상 및 위탁 및 제휴 업무 내용은 아래와 같습니다.\n" +
            "  1) 공유 대상자: 서비스 제공자, 서비스를 위한 부품 제공자\n" +
            "  2) 위탁 업무 내용 및 목적: 홈서비스의 제공\n" +
            "  3) 제공하는 개인정보 항목: 예약정보(휴대폰 번호, 예약자명, 서비스현장 주소)\n" +
            "  4) 개인정보의 보유 및 이용기간: 서비스 제공기간 (관계법령의 규정에 의하여 보존할 필요가 있는 경우 및 사전 동의를 얻은 경우 해당 보유 기간)\n" +
            "  다만, 이용자는 관련법에 따라 수집한 개인정보의 업무위탁에 따른 제공 동의를 거부할 권리가 있으며, 미동의시 서비스 이행을 위한 위탁업체 제공이 불가능하여 서비스 제한을 받으실 수 있습니다.\n" +
            "\n" +
            "7. 개인정보 파기\n" +
            "  홈코코는 이용자의 개인정보에 대해 “개인정보의 수집·이용 목적이 달성”된 후에는 해당 정보를 재생할 수 없는 기술적인 방법을 이용하여 완전하게 삭제하게 되고, 종이로 출력된 개인정보는 분쇄하거나 소각하여 지체 없이 파기함을 약속합니다.\n" +
            "\n" +
            "8. 이용자의 권리\n" +
            "  홈코코는 서비스 이용에 대해, 이용자의 권리를 다음과 같이 보호하고 있습니다.\n" +
            "\n" +
            "  ㄱ. 언제든지 등록되어 있는 자신의 개인정보를 조회하고 삭제할 수 있습니다. 다만, 그러한 경우 해당 서비스의 일부 또는 전부 이용이 어려울 수 있습니다.\n" +
            "  ㄴ. 언제든지 개인정보 제공에 관한 동의 철회를 요청할 수 있습니다.\n" +
            "  ㄷ. 이용자가 개인정보의 오류에 대한 정정을 요청하신 경우에는 정정을 완료하기 전까지 해당 개인정보를 이용 또는 제공하지 않습니다. 또한 잘못된 개인정보를 제3 자에게 이미 제공한 경우에는 정정 처리 결과를 제3자에게 지체 없이 통지하여 정정이 이루어지도록 하겠습니다.\n" +
            "  ㄹ. 회사는 이용자 혹은 법정 대리인의 요청에 의해 해지 또는 삭제된 개인정보는 \"개인정보의 보유 및 이용기간\"에 명시된 바에 따라 처리하고 그 외의 용도로 열람 또는 이용할 수 없도록 처리하고 있습니다.\n" +
            "\n" +
            "9. 링크 사이트에 대한 책임\n" +
            "  회사는 이용자에게 다른 웹사이트에 대한 링크를 제공할 수 있습니다. 다만, 링크되어 있는 웹사이트들이 개인정보를 수집하는 행위에 대해서는 본 \"개인정보취급방침\"이 적용되지 않습니다.\n" +
            "\n" +
            "10. 개인정보의 기술적/관리적 보호 대책\n" +
            "  회사는 이용자들의 개인정보를 취급함에 있어 개인정보가 분실, 도난, 누출, 변조 또는 훼손되지 않도록 안전성 확보를 위하여 다음과 같은 기술적/관리적 대책을 강구하고 있습니다.\n" +
            "  ㄱ. 비밀번호 암호화 : 회원 비밀번호는 암호화되어 저장 및 관리되고 있어 본인만이 알고 있으며, 개인정보의 확인 및 변경도 비밀번호를 알고 있는 본인에 의해서만 가능합니다.\n" +
            "  ㄴ. 해킹 등에 대비한 대책 : 회사는 해킹이나 컴퓨터 바이러스 등에 의해 회원의 개인정보가 유출되거나 훼손되는 것을 막기 위해 최선을 다하고 있습니다. 개인정보의 훼손에 대비해서 자료를 수시로 백업하고 있고, 최신 백신프로그램을 이용하여 이용자들의 개인정보나 자료가 누출되거나 손상되지 않도록 방지하고 있으며, 암호화통신 등을 통하여 네트워크상에서 개인정보를 안전하게 전송할 수 있도록 하고 있습니다. 그리고 침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있으며, 기타 시스템적으로 보안성을 확보하기 위한 가능한 모든 기술적 장치를 갖추려 노력하고 있습니다.\n" +
            "  ㄷ. 취급 직원의 최소화 및 교육 : 회사의 개인정보관련 취급 직원은 담당자에 한정시키고 있고 이를 위한 별도의 비밀번호를 부여하여 정기적으로 갱신하고 있으며, 담당자에 대한 수시 교육을 통하여 개인정보취급방침의 준수를 항상 강조하고 있습니다.\n" +
            "  ㄹ. 개인정보보호 전담기구의 운영 : 사내 개인정보보호 전담기구 등을 통하여 개인정보취급방침의 이행사항 및 담당자의 준수여부를 확인하여 문제가 발견될 경우 즉시 수정하고 바로 잡을 수 있도록 노력하고 있습니다. 단, 이용자 본인의 부주의나 인터넷상의 문제로 ID, 비밀번호 등 개인정보가 유출되어 발생한 문제에 대해 회사는 일체의 책임을 지지 않습니다.\n" +
            "\n" +
            "11. 개인정보 관리 책임자 및 담당부서\n" +
            "  책임자: 이상구\n" +
            "  담당부서: 홈코코 개발팀\n" +
            "  전화: 1588-4605\n" +
            "\n" +
            "  또한 개인정보가 침해되어 이에 대한 신고나 상담이 필요하신 경우에는 아래 기관에 문의하셔서 도움을 받으실 수 있습니다.\n" +
            "- 개인정보 침해신고센터 ( http://privacy.kisa.or.kr / (국번없이)118 )\n" +
            "- 정보보호마크인증위원회 ( http://www.eprivacy.or.kr / 02-550-9531~2 )\n" +
            "- 경찰청 사이버안전국 ( http://cyberbureau.police.go.kr / (경찰청 대표)182 )\n" +
            "\n" +
            "12. 고지의 의무\n" +
            "  홈코코는 위 내용에 대한 추가, 삭제 및 수정이 있을 경우에는 시행하는 날로부터 최소 7일전에 각 서비스의 공지사항을 통해 이용자에게 설명 드리겠습니다. 다만 이용자의 소중한 권리 또는 의무에 중요한 내용 변경은 최소 30일 전에 알려 드리겠습니다.\n" +
            "\n" +
            "- 개인정보취급방침 버전번호: 1.0\n" +
            "- 개인정보취급방침 시행일자: 2017년 04 월 10 일\n" +
            "- 개인정보취급방침 변경공고일자: 2017년 04 월 10 일";

}
